Repository: KDE/kturtle
Catalog: po/*/kturtle.po
Languages: ar, eo

source: Show Code Editor: Show or hide the Code Editor
ar: عرض محرر الرموز: إظهار أو إخفاء مُحرّر الرموز
eo: Montri Kodredaktilon: Montru aŭ kaŝu la Kodredaktilon

source: Show &Inspector
ar: أظهر المفت&ش
eo: Montri &Inspektiston

source: Show or hide the Inspector
ar: إظهار أو إخفاء المفتش
eo: Montri aŭ kaŝi la Inspektiston

source: Show Inspector: Show or hide the Inspector
ar: عرض المفتش: إظهار أو إخفاء المفتش
eo: Montri Inspektiston: Montru aŭ kaŝu la Inspektiston

source: Show E&rrors
ar: أظهر الأ&خطاء
eo: Montri E&rarojn

source: Show or hide the Errors tab
ar: عرض أو إخفاء لسان الأخطاء
eo: Montri aŭ kaŝi la langeton Eraroj

source: Show Errors: Show or hide the Errors tab
ar: عرض الأخطاء: عرض أو إخفاء لسان الأخطاء
eo: Montri Erarojn: Montru aŭ kaŝu la langeton Eraroj

source: Show &Line Numbers
ar: أظهر أر&قام الأسطر
eo: Montri &lininombrojn

source: Turn the line numbers on/off in the editor
ar: إخفاء أو إظهار أرقام الأسطر في المحرر
eo: Enŝalti/malŝalti la linionumeroj en la redaktilo

source: Show Line Numbers: Turn the line numbers on/off in the editor
ar: عرض أرقام الأسطر: إخفاء أو إظهار أرقام الأسطر في المحرر
eo: Montri Linion-Numerojn: Enŝaltu/malŝaltu la linio-numeroj en la redaktilo

source: Get help on the command under the cursor
ar: المساعدة في الأمر أسفل المؤشر
eo: Ricevi helpon pri la komando sub la kursoro

source: Context Help: Get help on the command under the cursor
ar: المساعدة السياقية: احصل على المساعدة بشأن الأمر أسفل المؤشر
eo: Kunteksta Helpo: Akiru helpon pri la komando sub la kursoro

source: Help
ar: مساعدة
eo: Helpo

source: Help: Open manual for KTurtle
ar: مساعدة: دليل استعمال KTurtle
eo: Helpo: Malfermu manlibron por KTurtle

source: Console
ar: الطرفية
eo: Konzolo

source: Execute
ar: تنفيذ
eo: Lanĉi

source: Execute: Executes the current line in the console
ar: تنفيذ: تنفيذ السطر الحالي في الطرفية
eo: Execute: Efektivigas la aktualan linion en la konzolo

source: Execute the program, or use the drop down menu to select the run speed
ar: تنفيذ البرنامج، أو استعمل القائمة المنسدلة لتحديد السرعة
eo: Efektivigi la programon aŭ uzi la falmenuon por elekti la kurrapidecon

source: Run: Execute the program, or use the drop down menu to select the run speed
ar: تنفيذ: تنفيذ البرنامج، أو استعمل القائمة المنسدلة لتحديد السرعة
eo: Lanĉi: Efektivigi la programon, aŭ uzi la falmenuon por elekti la rulrapidecon

# @option:radio
source: Full Speed (&no highlighting and inspector)
ar: السرعة القصوى (لا تمييز أو تفتيش)
eo: Plena Rapido (&sen reliefigo kaj inspektisto)

source: Run the program at full speed, with highlighting and inspector disabled
ar: تشغيل البرنامج بالسرعة القصوى، مع إيقاف التفتيش والتمييز
eo: Ruli la programon plenrapide, kun reliefigo kaj inspektisto malŝaltitaj

source: Full Speed: Run the program at full speed, with highlighting and inspector disabled
ar: السرعة القصوى: تشغيل البرنامج بالسرعة القصوى، مع إيقاف التفتيش والإبراز
eo: Plena Rapido: Rulu la programon plenrapide, kun reliefigo kaj inspektisto malebligitaj

# @option:radio
source: &Full Speed
ar: السرعة ال&قصوى
eo: &Plena Rapido

source: Run the program at full speed
ar: شغل البرنامج بأقصى سرعة
eo: Ruli la programon plenrapide

source: Full Speed: Run the program at full speed
ar: السرعة القصوى: شغل البرنامج بأقصى سرعة
eo: Plena Rapido: Rulu la programon plenrapide

# @option:radio choose the slow speed
source: &Slow
ar: &بطيء
eo: &Malrapida

source: Run the program at a slow speed
ar: شغل البرنامج ببطء
eo: Ruli la programon malrapide

source: Slow Speed: Run the program at a slow speed
ar: سرعة بطيئة: شغل البرنامج ببطء
eo: Malrapida Rapido: Rulu la programon malrapide

# @option:radio
source: S&lower
ar: أب&طأ
eo: Pli ma&lrapida

source: Run the program at a slower speed
ar: شغل البرنامج بسرعة أبطأ
eo: Ruli la programon pli malrapide

source: Slower Speed: Run the program at a slower speed
ar: سرعة أبطأ: شغل البرنامج بسرعة أقل
eo: Pli malrapida rapido: rulu la programon pli malrapide

# @option:radio
source: Sl&owest
ar: ب&طيء جدًا
eo: Plej m&alrapida

source: Run the program at the slowest speed
ar: شغل البرنامج بسرعة بطيئة جدًا
eo: Ruli la programon kun la plej malrapida rapido

source: Slowest Speed: Run the program at the slowest speed
ar: بطيء جدًا: شغل البرنامج بأبطأ سرعة
eo: Plej Malrapida Rapido: Rulu la programon kun la plej malrapida rapido

# @option:radio
source: S&tep-by-Step
ar: &خطوة خطوة
eo: Paŝon post paŝo

source: Run the program one step at a time
ar: شغل البرنامج خطوة واحدة كل مرة
eo: Ruli la programon unu paŝon samtempe

source: Step Speed: Run the program one step at a time
ar: سرعة الخطوة: شغل البرنامج خطوة واحدة كل مرة
eo: Paŝa Rapido: Rulu la programon unu paŝon samtempe

source: Canvas: This is where the turtle moves and draws when the program is running
ar: الرقعة: هنا يتحرك السلحفاة و يرسم عندما يشتغل البرنامج
eo: Kanvaso: Ĉi tie la testudo moviĝas kaj desegnas kiam la programo funkcias

source: E&rrors
ar: الأ&خطاء
eo: E&eraroj

source: &Editor
ar: &المحرر

source: Editor: Write your KTurtle commands here
ar: المحرر: أكتب أوامر السلحفاة هنا
eo: Redaktoro: Skribu viajn KTurtle-komandojn ĉi tie

source: &Inspector
ar: الم&فتش
eo: &Inspektisto

source: Inspector: See information about variables and functions when the program runs
ar: المفتش: أنظر إلى المعلومات حول المتغيرات و الدوال عندما يشتغل البرنامج
eo: Inspektisto: Vidu informojn pri variabloj kaj funkcioj kiam la programo funkcias

source: Switch to the %1 dictionary
ar: حول إلى القاموس %1
eo: Ŝanĝi al la vortaro %1

source: OVR
ar: طمس
eo: ANST

source: INS
ar: إدراج
eo: ENM

source: <nothing under cursor>
ar: <لاشيء تحت المؤشر>
eo: <nenio sub kursoro>

source: Help on: %1
ar: مساعدة عن: %1
eo: Helpo pri: %1

source: Line: %1 Column: %2
ar: سطر: %1 عمود: %2
eo: Linio: %1 Kolumno: %2

source: <variable>
ar: <متغير>
eo: <variablo>

source: <number>
ar: <عدد>
eo: <nombro>

source: <comment>
ar: <تعليق>
eo: <komento>

source: <string>
ar: <سلسلة>
eo: <ĉeno>

source: scope
ar: مجال
eo: amplekso

source: assignment
ar: إسناد
eo: tasko

source: parenthesis
ar: أقواس
eo: krampoj

source: mathematical operator
ar: عوامل رياضية
eo: matematika operatoro

source: expression
ar: تعبير
eo: esprimo

source: boolean operator
ar: عامل منطقي
eo: bulea operatoro

source: learned command
ar: تعلم الأمر
eo: lernita komando

source: argument separator
ar: فاصل المعطيات
eo: argumenta apartigilo

source: command
ar: أمر
eo: komando

source: controller command
ar: أمر التحكّم
eo: komando de regilo

source: Could not change the language to %1.
ar: لا يمكن تغيير اللغة إلى %1.
eo: Ne eblis ŝanĝi la lingvon al %1.

source: English [built in]
ar: الإنجليزية [مبدئي]
eo: la angla [enkonstruita]

source: untitled
ar: بلا عنوان
eo: sentitola

source: Save as Picture
ar: حفظ كصورة
eo: Konservi kiel Bildo

source: PNG Images
ar: صور PNG
eo: PNG Bildoj

# @title:window
source: Save as SVG
ar: احفظ كـ SVG
eo: Konservi kiel SVG

source: Scalable Vector Graphics
ar: رسم متجهي (شعاعي)
eo: Skalebla Vektora Grafiko

# @title:window
source: Save code as HTML
ar: حفظ الشفرة بصيغة HTML
eo: Konservi kodon kiel HTML

source: HTML documents
ar: مستند HTML
eo: HTML-dokumentoj

source: Input
ar: إدخال
eo: Enigo

source: Message
ar: رسالة
eo: Mesaĝo
