Repository: KDE/kturtle
Catalog: po/*/kturtle.po
Languages: ar, eo

# NAME OF TRANSLATORS
source: Your names
ar: خالد حسني, طه زروقي Taha Zerrouki
eo: Axel Rousseau,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
ar: khaledhosny@eglug.org, taha.zerrouki@gmail.com
eo: axel@esperanto-jeunes.org,olivermkellogg@gmail.com

source: bold
ar: سميك
eo: grasa

source: italic
ar: مائل
eo: kursivo

source: underline
ar: تسطير
eo: substreki

source: overline
ar: سطر_علوي

source: strikeout
ar: شطب
eo: forstreko

# @title:window
source: Color Picker
ar: محدد الألوان
eo: Kolora elektilo

source: Amount red:
ar: كمية الأحمر:
eo: Ruĝa kvanto:

source: Amount green:
ar: كمية الأخضر:
eo: Verda kvanto:

source: Amount blue:
ar: كمية الأزرق:
eo: Blua kvanto:

source: &Copy to clipboard
ar: &نسخ للحافظة
eo: Kopii al tondujo

source: &Paste to editor
ar: &لصق في المحرر
eo: &Alglui al redaktilo

source: Write a command here and press enter...
ar: أكتب أمرا هنا و اضغط على مفتاح Enter...
eo: Skribu komandon ĉi tie kaj premu enter...

source: Console: quickly run single commands -- write a command here and press enter.
ar: طرفية: تشغيل سريع لأمر واحد -- أكتب أمرًا هنا و اضغط مفتاح Enter.
eo: Konzolo: rapide rulu unuopajn komandojn -- skribu komandon ĉi tie kaj premu enen.

source: Console:
ar: طرفية:
eo: Konzolo:

source: <p style='white-space:pre'><b>ERROR:</b> %1</p>
ar: <p style='white-space:pre'><b>خطأ:</b> %1</p>
eo: <p style='white-space:pre'><b>ERARO:</b> %1</p>

# @title:window
source: Direction Chooser
ar: محدد الاتجاه
eo: Direkto Elektilo

source: Command &type:
ar: &نوع الأمر:
eo: Komanda &tipo:

source: &Previous direction:
ar: الا&تجاه السابق:
eo: &Antaŭa direkto:

source: &New direction:
ar: الاتجاه الج&ديد:
eo: &Nova direkto:

source: Open
ar: افتح
eo: Malfermi

source: Turtle code files
ar: شفرة ملفات السلحفاة
eo: Turtle-koddosieroj

source: All files
ar: جميع الملفات
eo: Ĉiuj dosieroj

source: The file you try to open is not a valid KTurtle script, or is incompatible with this version of KTurtle. Cannot open %1
ar: الملف الذي تحاول فتحه ليس صالحا كمخطوط KTurtle، أو هو غير متناسب مع هذه النسخة من KTurtle. من غير الممكن فتح %1
eo: La dosiero, kiun vi provas malfermi, ne estas valida KTurtle-skripto, aŭ estas nekongrua kun ĉi tiu versio de KTurtle. Ne povas malfermi %1

source: Could not save file.
ar: تعّذر حفظ الملف.
eo: Ne eblis konservi dosieron.

source: Save As
ar: احفظ باسم
eo: Konservi kiel

source: The program you are currently working on is not saved. By continuing you may lose the changes you have made.
ar: البرنامج الذي تعمل عليه حاليا غير محفوظ. إذا تابعت قد تفقد تعديلاتك.
eo: La programo, pri kiu vi nun laboras, ne estas konservita. Daŭrigante vi eble perdos la ŝanĝojn kiujn vi faris.

source: Unsaved File
ar: ملف غير محفوظ
eo: Nekonservita Dosiero

source: &Discard Changes
ar: ت&جاهل التغييرات
eo: &Forĵeti la ŝanĝojn

# @title:window
source: Errors
ar: أخطاء
eo: Eraroj

source: In this list you find the error(s) that resulted from running your code. Good luck!
ar: في هذه القائمة تجد الأخطاء الناتجة عن تشغيل الشفرة. بالتوفيق!
eo: En ĉi tiu listo vi trovas la eraron(j)n kiu rezultis el rulado de via kodo. Bonan sorton!

source: line
ar: سطر
eo: linio

source: description
ar: وصف
eo: priskribo

source: code
ar: رمز
eo: kodo

source: Hide Errors
ar: أخف الأخطاء
eo: Kaŝi Erarojn

source: No errors occurred yet.
ar: لم تحدث أي أخطاء بعد.
eo: Ankoraŭ neniuj eraroj okazis.

source: Variables
ar: المتغيرات
eo: Variabloj

source: Functions
ar: الدوال
eo: Funkcioj

source: Tree
ar: الشجرة
eo: Arbo

source: name
ar: اسم
eo: nomo

source: value
ar: قيمة
eo: valoro

source: type
ar: نوع
eo: tipo

source: No variables
ar: لا متغيرات
eo: Neniuj variabloj

source: parameters
ar: معاملات
eo: parametroj

source: No learned functions
ar: لا توجد دوال مُتعلمة
eo: Neniuj lernitaj funkcioj

# undefined type of a variable
source: empty
ar: فارغ
eo: malplena

source: boolean
ar: منطقي
eo: bulea

source: number
ar: رقم
eo: nombro

source: string
ar: سلسلة
eo: ĉeno

source: None
ar: لا شيء
eo: Neniu

source: Cannot return outside a function.
ar: لا يمكن الرجوع خارج دالة.
eo: Ne povas reveni ekster funkcio.

source: The %1 command accepts no parameters.
ar: لا يقبل الأمر %1 أيّة معاملات.
eo: La komando %1 akceptas neniujn parametrojn.

source: The %2 command was called with %3 but needs 1 parameter.
ar: اُستدعِيَ الأمر %2 بـلا معاملات (%3) لكنه يحتاج إلى معامل واحد.
eo: La komando %2 estis vokita kun %3 sed bezonas 1 parametron.

source: The %2 command was called with %3 but only accepts 1 parameter.
ar: اُستدعِيَ الأمر %2 بـلا معاملات %3 لكنه يقبل معاملًا واحدًا فقط.
eo: La komando %2 estis vokita kun %3 sed nur akceptas 1 parametron.

source: The %1 command only accepts a string as its parameter.
ar: يقبل الأمر %1 سلسلة نصّية معاملاً له فقط.
eo: La komando %1 nur akceptas ĉenon kiel sian parametron.

source: The %1 command only accepts strings as its parameters.
ar: يقبل الأمر %1 سلاسل نصّية معاملات له فقط.
eo: La komando %1 nur akceptas ĉenojn kiel ĝiajn parametrojn.

source: The %1 command only accepts a number as its parameter.
ar: يقبل الأمر %1 رقما فقط معاملاً له.
eo: La komando %1 nur akceptas nombron kiel sian parametron.

source: The %1 command only accepts numbers as its parameters.
ar: يقبل الأمر %1 أرقاما فقط كمعاملات له.
eo: La komando %1 akceptas nur nombrojn kiel siajn parametrojn.

source: The %1 command only accepts an answer as its parameter.
ar: يقبل الأمر %1 يقبل جوابًا واحدا معاملًا له فقط.
eo: La komando %1 nur akceptas respondon kiel sian parametron.

source: The %1 command only accepts answers as its parameters.
ar: يقبل الأمر %1 يقبل أجوبةً معاملات له فقط.
eo: La komando %1 nur akceptas respondojn kiel siajn parametrojn.

source: The variable '%1' was used without first being assigned to a value
ar: المتغير %1 استخدم دون أن تسند له قيمة
eo: La variablo '%1' estis uzata sen antaŭe esti atribuita al valoro

source: An unknown function named '%1' was called
ar: استدعيت دالة غير معروفة اسمها '%1'
eo: Nekonata funkcio nomita '%1' estis vokita

source: The function '%1' was called with %2, while it should be called with %3
ar: اُستُدعيت الدالة بـ '%1' %2, لكنه ينبغي أن تُستدعى بـ %3
eo: La funkcio '%1' estis vokita per %2, dum ĝi devus esti vokita per %3

# The function '%1' was called with %2, while it should be called with %3
source: 1 parameter
ar: لا يوجد معامل
eo: 1 parametro

source: ASSERT failed
ar: فشل التأكيد
eo: ASSERT malsukcesis

source: 'And' needs two variables
ar: "و" بحاجة إلى متغيرين
eo: 'Kaj' bezonas du variablojn

source: 'Or' needs two variables
ar: "أو" بحاجة إلى متغيرين
eo: 'Aŭ' bezonas du variablojn

source: I need something to do a not on
ar: أحتاج إلى شيء ما لأنفيه بـ"لا"
eo: Mi bezonas ion por fari kaj ne

source: I cannot do a '==' without 2 variables
ar: لا أستطيع المقارنة بـ '==' دون متغيرين
eo: Mi ne povas fari '==' sen 2 variabloj

source: I cannot do a '!=' without 2 variables
ar: لا أستطيع المقارنة بـ '!=' دون متغيرين
eo: Mi ne povas fari '!=' sen 2 variabloj

source: I cannot do a '>' without 2 variables
ar: لا أستطيع المقارنة بـ '&gt;' دون متغيرين
eo: Mi ne povas fari '>' sen 2 variabloj

source: I cannot do a '<' without 2 variables
ar: لا أستطيع المقارنة بـ '&lt;' دون متغيرين
eo: Mi ne povas fari '<' sen 2 variabloj

source: I cannot do a '>=' without 2 variables
ar: لا أستطيع المقارنة بـ ''=&gt;'' دون متغيرين
eo: Mi ne povas fari '>=' sen 2 variabloj

source: I cannot do a '<=' without 2 variables
ar: لا أستطيع المقارنة بـ '&lt;=' دون متغيرين
eo: Mi ne povas fari '<=' sen 2 variabloj

source: You need two numbers or string to do an addition
ar: تحتاج إلى عددين أو سلسة حروف لعملية الجمع
eo: Vi bezonas du nombrojn aŭ ĉenon por fari aldonon

source: You need two numbers to subtract
ar: تحتاج إلى عددين لعملية الطرح
eo: Vi bezonas du nombrojn por subtrahi

source: You tried to subtract from a non-number, '%1'
ar: لقد حاولت أن تطرح من قيمة غير عددية '%1'
eo: Vi provis subtrahi de ne-nombro, '%1'

source: You tried to subtract a non-number, '%1'
ar: لقد حاولت أن تطرح قيمة غير عددية '%1'
eo: Vi provis subtrahi ne-nombron, '%1'

source: You need two numbers to multiplicate
ar: تحتاج إلى عددين لعملية الضرب
eo: Vi bezonas du nombrojn por multipliki

source: You tried to multiplicate a non-number, '%1'
ar: لقد حاولت أن تضرب قيمة غير عددية '%1'
eo: Vi provis multobligi ne-nombron, '%1'

source: You tried to multiplicate by a non-number, '%1'
ar: لقد حاولت أن تضرب في قيمة غير عددية '%1'
eo: Vi provis multipliki per ne-nombro, '%1'

source: You need two numbers to divide
ar: تحتاج إلى عددين لعملية القسمة
eo: Vi bezonas du nombrojn por dividi

source: You tried to divide by zero
ar: لقد حاولت القسمة على صفر
eo: Vi provis dividi per nulo

source: You tried to divide a non-number, '%1'
ar: لقد حاولت قسمة قيمة غير عددية، '%1'
eo: Vi provis dividi ne-nombron, '%1'

source: You tried to divide by a non-number, '%1'
ar: لقد حاولت القسمة على قيمة غير عددية، '%1'
eo: Vi provis dividi per ne-nombro, '%1'

source: You need two numbers to raise a power
ar: تحتاج إلى عددين للرفع إلى قوة (أس)
eo: Vi bezonas du nombrojn por levi potencon

source: The result of an exponentiation was too large
ar: نتيجة هذه العملية الأسية كبيرة جدا
eo: La rezulto de eksponentigo estis tro granda

source: You tried to raise a non-number to a power, '%1'
ar: لقد حاولت رفع قيمة غير عددية إلى قوة، ,'%1'
eo: Vi provis levi ne-nombron al potenco, '%1'

source: You tried to raise the power of a non-number, '%1'
ar: لقد حاولت الرفع إلى قوة غير عددية، '%1'
eo: Vi provis altigi la potencon de ne-nombro, '%1'

source: You need one variable and a value or variable to do a '='
ar: أنت بحاجة إلى متغير أو متغير وقيمة لعمل '='
eo: Vi bezonas unu variablon kaj valoron aŭ variablon por fari '='

source: The function '%1' is already defined.
ar: الدالة '%1' مُعرّفة سابقا.
eo: La funkcio '%1' jam estas difinita.

source: Can't do a sqrt of a negative number
ar: لا يمكن حساب الجذر التربيعي لعدد سالب
eo: Ne povas fari kvadraton de negativa nombro

source: Expected a command, instead got '%1'
ar: نتوقّع أمرًا، بدلاً من '%1'
eo: Atendis komandon, anstataŭe ricevis '%1'

source: Could not understand '%1'
ar: '%1' غير مفهوم
eo: Ne povis kompreni '%1'

source: A comma was expected here...
ar: نتوقّع فاصلة هنا...
eo: Komo estis atendita ĉi tie...

source: Did not expect '%1', instead expected the line to end after %2
ar: لا نتوقّع %1، لكن يُتوقّع أن ينتهي السطر بعد %2
eo: Ne atendis '%1', anstataŭe atendis, ke la linio finiĝos post %2

source: Expected an assignment, '=', after the variable '%1'
ar: ُيُتوقّع إسناد، '='، بعد المتغير '%1'
eo: Atendita tasko, '=', post la variablo '%1'

source: Did not expect '%1', instead expected a closing parenthesis, ')'
ar: لم نتوقع '%1'، كان متوقعا قوس مغلق، ')'
eo: Ne atendis '%1', anstataŭe atendis ferman krampon, ')'

source: Expected 'to' after 'for'
ar: يُتوقع 'إلى' بعد 'لكل'
eo: Atendita "al" post "por"

source: Expected a name for a command after 'learn' command
ar: اسم أمر متوقّع بعد الأمر "تعلم"
eo: Atendita nomo por komando post "lerni" komando

source: You cannot put '%1' here.
ar: لا تستطيع أن تضع '%1' هنا.
eo: Vi ne povas meti '%1' ĉi tie.

source: Text string was not properly closed, expected a double quote, ' " ', to close the string.
ar: سلسلة نصية لم تُغلق إغلاقًا صحيحًا، كان متوقعا علامات تنصيص مزدوجة ' " '، لإغلاق السلسلة النصية.
eo: Tekstoĉeno ne estis ĝuste fermita, atendis duoblan citilon, ' " ', por fermi la ĉenon.

source: 'for' was called wrongly
ar: اُستدعيت 'لكل' استدعاءً خاطئا
eo: 'por' estis malĝuste nomita

source: Expected a scope after the 'learn' command
ar: مجال متوقّع بعد الأمر 'تعلم'
eo: Atendita amplekso post la komando 'lerni'

source: true
ar: صح

source: false
ar: غلط

source: exit
ar: اخرج

source: if
ar: إذا

source: else
ar: وإلا

source: repeat
ar: كرر

source: while
ar: مادام

source: for
ar: لكل

source: to
ar: إلى

source: step
ar: خطوة

source: break
ar: اكسر

source: return
ar: إرجاع

source: wait
ar: انتظر

source: assert
ar: تحقق

source: and
ar: و

source: or
ar: أو

source: not
ar: ليس

source: learn
ar: تعلم

source: reset
ar: جدد

source: clear
ar: امسح

source: ccl
ar: مسح

source: center
ar: وسط

source: go
ar: اذهب

source: gox
ar: اذهب_س

source: gx
ar: سين

source: goy
ar: اذهب_ص

source: gy
ar: صاد

source: forward
ar: تقدم

source: fw
ar: أمام

source: backward
ar: وراء

source: bw
ar: خلف

source: direction
ar: اتجاه

source: dir
ar: جهة

source: turnleft
ar: در_يسار

source: tl
ar: يسار

source: turnright
ar: در_يمين

source: tr
ar: يمين

source: penwidth
ar: عرض_القلم

source: pw
ar: عرض

source: penup
ar: رفع_القلم

source: pu
ar: رفع

source: pendown
ar: ضع_القلم

source: pd
ar: ضع

source: pencolor
ar: لون_القلم

source: pc
ar: لون

source: canvascolor
ar: لون_الرقعة

source: cc
ar: خلفية

source: canvassize
ar: حجم_الرقعة

source: cs
ar: حجم

source: spriteshow
ar: أظهر

source: ss
ar: إظهار

source: spritehide
ar: أخف

source: sh
ar: إخفاء

source: print
ar: اطبع

source: fontsize
ar: حجم_الخط

source: random
ar: عشوائي

source: rnd
ar: عشو

source: getx
ar: هات_س

source: gety
ar: هات_ص

source: message
ar: رسالة

source: ask
ar: اسأل

source: pi
ar: طا

source: tan
ar: ظا

source: sin
ar: جا

source: cos
ar: جتا

source: arctan
ar: قوس_ظل

source: arcsin
ar: قوس_جا

source: arccos
ar: قوس_جتا

source: sqrt
ar: جذر

source: round
ar: تقريب

source: getdirection
ar: هات_اتجاه

source: mod
ar: باقي

source: triangle
ar: مثلّث

source: curly
ar: مموج

source: arrow
ar: سهم

source: flower
ar: زهرة

source: &File
ar: &ملف
eo: &Dosiero

source: &Examples
ar: أم&ثلة
eo: &Ekzemploj

source: &Edit
ar: &حرّر
eo: &Redakti

source: &Canvas
ar: الر&قعة
eo: &Kanvaso

source: &Run
ar: &شغّل
eo: &Ruli

source: &Run Speed
ar: سرعة الت&شغيل
eo: &Rula Rapido

source: &Tools
ar: أ&دوات
eo: &Iloj

source: &Settings
ar: إ&عدادات
eo: A&gordo

source: &Script Language
ar: ل&غة البرمجة
eo: &Skriptlingvo

source: &Help
ar: م&ساعدة
eo: &Helpo

source: Main Toolbar
ar: شريط الأدوات الرئيسي
eo: Ĉefa ilobreto

source: KTurtle
ar: سلحفاتك

source: KTurtle is an educational programming environment that aims to make learning how to program as easy as possible. To achieve this KTurtle makes all programming tools available from the user interface. The programming language used is TurtleScript which allows its commands to be translated.
ar: سلحفاتك Kturtle بيئة برمجة تعليمية تهدف إلى تسهيل تعلم البرمجة، وخصوصا للأطفال الصغار. لتحقيق هذا تجعل سلحفاة ك جميع أدوات البرمجة متاحة من واجهة المستخدم. لغة البرمجة المستخدمة هي TurtleScript والتي تسمح بترجمة أوامرها.
eo: KTurtle estas eduka programa medio, kiu celas kiel eble plej facila lerni kiel programi. Por atingi ĉi tion KTurtle disponigas ĉiujn programajn ilojn de la uzantinterfaco. La programlingvo uzata estas TurtleScript kiu permesas traduki ĝiajn komandojn.

source: Initiator and core developer
ar: المبادر والمطور الأساسي
eo: Iniciatinto kaj kerna programisto

source: Core developer
ar: مطوّر أساسي
eo: Kerna programanto

source: File or URL to open (in the GUI mode)
ar: ملف أو مسار gفتحه (بنظام واجهة المستخدم)
eo: Dosiero aŭ URL por malfermi (en la GUI-reĝimo)

source: Starts KTurtle in D-Bus mode (without a GUI), good for automated unit test scripts
ar: ابدأ سلحفاتك في وضع الاختبار دون واجهة، مفيد لاختبار البرامج
eo: Lanĉas KTurtle en D-Bus-reĝimo (sen GUI), bona por aŭtomatigitaj unutestaj skriptoj

source: Starts KTurtle in testing mode (without a GUI), directly runs the specified local file
ar: ابدأ سلحفاتك في وضع الاختبار (دون واجهة رسومية)،تشغيل الملف المحدد مباشرة
eo: Lanĉas KTurtle en prova reĝimo (sen GUI), rekte rulas la specifitan lokan dosieron

source: Specifies the localization language by a language code, defaults to "en_US" (only works in testing mode)
ar: تعيين اللغة المحلية بواسطة رمز لغة، مبدئيا "en_US" (فقط في وضع الاختبار)
eo: Specifas la lokalizan lingvon per lingvokodo, defaŭlte al "en_US" (nur funkcias en testareĝimo)

source: Translates turtle code to embeddable C++ example strings (for developers only)
ar: ترجم شفرة Turtle إلى نصوص أمثلة C++ محمولة (للمطورين فقط)
eo: Tradukas testuda kodo al enigeblaj ekzemploj de C++ (nur por programistoj)

# @info:status the application is ready for commands
source: Ready
ar: جاهز
eo: Preta

source: Create a new file
ar: أنشئ ملفا جديدا
eo: Krei novan dosieron

source: New File: Create a new file
ar: ملف جديد: أنشئ ملف جديد
eo: Nova Dosiero: Krei novan dosieron

source: Open an existing file
ar: افتح الملف موجودا
eo: Malfermi ekzistantan dosieron

source: Open File: Open an existing file
ar: افتح ملف: افتح ملف موجود
eo: Malfermi Dosieron: Malfermu ekzistantan dosieron

source: Open a recently used file
ar: فتح الملفات الأخيرة
eo: Malfermi lastatempe uzatan dosieron

source: Open Recent File: Open a recently used file
ar: فتح آخر ملف: افتح أخر ملف مستعمل
eo: Malfermi Lastatempan Dosieron: Malfermu lastatempe uzatan dosieron

source: Get more examples...
ar: اجلب أمثلة أكثر...
eo: Ekhavi pliajn ekzemplojn...

source: Save the current file to disk
ar: احفظ الملف الحالي في القرص
eo: Konservi la nunan dosieron al disko

source: Save File: Save the current file to disk
ar: احفظ الملف: احفظ الملف الحالي في القرص
eo: Konservi dosieron: Konservu la nunan dosieron al disko

source: Save the current file under a different name
ar: احفظ الملف الحالي باسم مختلف
eo: Konservi la nunan dosieron sub malsama nomo

source: Save File As: Save the current file under a different name
ar: احفظ الملف باسم: احفظ الملف الحالي باسم مختلف
eo: Konservi dosieron kiel: Konservu la nunan dosieron sub malsama nomo

source: Export to &HTML...
ar: صدّر لصيغة &HTML...
eo: Eksporti al &HTML...

source: Export the contents of the editor as HTML
ar: تصدير محتوى المحرر إلى صيغة HTML
eo: Eksporti la enhavon de la redaktilo kiel HTML

source: Export to HTML: Export the contents of the editor as HTML
ar: تصدير لصيغة HTML: تصدير محتوى المحرر لصيغة صفحة وب HTML
eo: Eksporti al HTML: Eksportu la enhavon de la redaktilo kiel HTML

source: Print the code
ar: اطبع الرمز
eo: Presi la kodon

source: Print: Print the code
ar: اطبع: اطبع الرمز
eo: Presi: Presu la kodon

source: Quit KTurtle
ar: خروج
eo: Forlasi KTurtle

source: Quit: Quit KTurtle
ar: خروج: خروج من سلحفاتك
eo: Quit: Forlasu KTurtle

source: Undo a change in the editor
ar: إلغاء آخر تعديل في المحرر
eo: Malfari ŝanĝon en la redaktilo

source: Undo: Undo a change in the editor
ar: تراجع: إلغاء آخر تعديل في المحرر
eo: Malfari: Malfari ŝanĝon en la redaktilo

source: Redo a previously undone change in the editor
ar: استرجع ما تراجعت عنه سابقًا في المحرر
eo: Refari antaŭe nefaritan ŝanĝon en la redaktilo

source: Redo: Redo a previously undone change in the editor
ar: أعد: استرجاع ما تراجعت عنه سابقًا في المحرر
eo: Refari: Refari antaŭe nefaritan ŝanĝon en la redaktilo

source: Cut the selected text to the clipboard
ar: قص النص المحدد إلى الحافظة
eo: Tranĉi la elektitan tekston al la tondujo

source: Cut: Cut the selected text to the clipboard
ar: قص: قص النص المحدد إلى الحافظة
eo: Tranĉi: Tranĉu la elektitan tekston al la tondujo

source: Copy the selected text to the clipboard
ar: انسخ النص المحدد إلى الحافظة
eo: Kopii la elektitan tekston al la tondujo

source: Copy: Copy the selected text to the clipboard
ar: انسخ: نسخ النص المحدد إلى الحافظة
eo: Kopii: Kopiu la elektitan tekston al la tondujo

source: Paste the clipboard's content into the current selection
ar: لصق محتوى الحافظة في التحديد الحالي
eo: Alglui la enhavon de la tondujo en la nunan elekton

source: Paste: Paste the clipboard's content into the current selection
ar: لصق: لصق محتوى الحافظة في التحديد الحالي
eo: Alglui: Algluu la enhavon de la tondujo en la nunan elekton

source: Select all the code in the editor
ar: اختيار كل الشفرة في المحرر
eo: Elekti la tutan kodon en la redaktilo

source: Select All: Select all the code in the editor
ar: حدّد الكل: تحديد كل الشفرة في المحرر
eo: Elekti Ĉion: Elektu la tutan kodon en la redaktilo

source: Overwrite Mode
ar: نمط الطمس
eo: Anstataŭigi Reĝimon

source: Toggle between the 'insert' and 'overwrite' mode
ar: بدّل بين نمط "الإدراج" ونمط "الطمس"
eo: Ŝanĝi inter la "enmeti" kaj "anstataŭigi" reĝimon

source: Overwrite Mode: Toggle between the 'insert' and 'overwrite' mode
ar: نمط الطمس: بدّل بين نمط "الإدراج" ونمط "الطمس"
eo: Anstataŭigi Reĝimon: Ŝanĝu inter la "enmeti" kaj "anstataŭigi" reĝimon

source: Search through the code in the editor
ar: بحث في الشفرة في المحرر
eo: Serĉi la kodon en la redaktilo

source: Find: Search through the code in the editor
ar: ابحث: ابحث في الشفرة في المحرر
eo: Trovi: Serĉu la kodon en la redaktilo

source: Continue searching through the code in the editor
ar: تابِع البحث في الشفرة في المحرر
eo: Daŭre serĉi la kodon en la redaktilo

source: Find Next: Continue searching through the code in the editor
ar: ابحث عن التالي: تابِع البحث في الشفرة في المحرر
eo: Trovi Sekvan: Daŭrigu serĉadon tra la kodo en la redaktilo

source: Continue searching backwards through the code in the editor
ar: تابِع البحث للخلف في الشفرة في المحرر
eo: Daŭre serĉi malantaŭen tra la kodo en la redaktilo

source: Find Previous: Continue searching backwards through the code in the editor
ar: ابحث عن السابق: تابِع البحث للخلف في الشفرة في المحرر
eo: Trovi Antaŭan: Daŭrigu serĉon malantaŭen tra la kodo en la redaktilo

source: Export to &Image (PNG)...
ar: صدّر لصورة (PNG)...
eo: Eksporti al B&ildo (PNG)...

source: Export the current canvas to a PNG raster image
ar: تصدير الرقعة الحالية إلى صورة نقطية PNG
eo: Eksporti la nunan kanvason al PNG rastruma bildo

source: Export to PNG: Export the current canvas to a PNG raster image
ar: صدّر إلى PNG: تصدير الرقعة الحالية إلى صورة نقطية PNG
eo: Eksporti al PNG: Eksportu la nunan kanvason al PNG rastruma bildo

source: Export to &Drawing (SVG)...
ar: صدّر لصيغة &رسم (SVG)...
eo: Eksporti al &Desegnaĵo (SVG)...

source: Export the current canvas to Scalable Vector Graphics
ar: تصدير الرقعة الحالية إلى رسم متجهي (شعاعي) SVG
eo: Eksporti la nunan kanvason al Skaleblaj Vektoraj Grafikoj

source: Export to SVG: Export the current canvas to Scalable Vector Graphics
ar: صدّر إلى SVG: تصدير الرقعة الحالية إلى رسم متجهي (شعاعي)
eo: Eksporti al SVG: Eksportu la nunan kanvason al Skaleblaj Vektoraj Grafikoj

source: &Print Canvas...
ar: ا&طبع الرقعة...
eo: &Presi Kanvason...

source: Print the canvas
ar: اطبع الرقعة
eo: Presi la kanvason

source: Print: Print the canvas
ar: اطبع: اطبع الرقعة
eo: Presi: Presi la kanvason

source: Execute the program
ar: نفّذ البرنامج
eo: Efektivigi la programon

source: Run: Execute the program
ar: شغّل: نفّذ البرنامج
eo: Run: Efektivigu la programon

source: &Pause
ar: تو&قّف
eo: &Paŭzi

source: Pause execution
ar: إيقاف التنفيذ مؤقتا
eo: Paŭzi la plenumon

source: Pause: Pause execution
ar: إيقاف مؤقت: إيقاف التنفيذ مؤقتا
eo: Paŭzo: Paŭzi la plenumon

source: &Abort
ar: أل&غِ
eo: &Haltigu

source: Stop executing program
ar: إيقاف التنفيذ
eo: Ĉesigi ruladon de programo

source: Abort: Stop executing program
ar: ألغ: أوقف التنفيذ نهائيا
eo: Aborti: Ĉesigu programrulon

source: &Direction Chooser...
ar: &محدد الاتجاه...
eo: &Direkto-Elektilo...

source: Shows the direction chooser dialog
ar: إظهار نافذة محدد الاتجاه
eo: Montras la dialogan elektilon de direkto

source: Direction Chooser: Show the direction chooser dialog
ar: محدد الاتجاه:إظهار نافذة محدد الاتجاه
eo: Direkto-Elektilo: Montru la direkto-elektilon dialogon

source: &Color Picker...
ar: &محدد الألوان...
eo: &Kolorelektilo...

source: Shows the color picker dialog
ar: إظهار نافذة محدد الألوان
eo: Montras la kolorelektilan dialogon

source: Color Picker: Show the color picker dialog
ar: محدد الألوان: إظهار نافذة محدد الألوان
eo: Kolor-elektilo: Montru la kolor-elektilan dialogon

source: Show &Editor
ar: أظهر الم&حرر
eo: Montri &Redaktilon

source: Show or hide the Code Editor
ar: إظهار أو إخفاء مُحرّر الشفرة
eo: Montri aŭ kaŝi la Kodredaktilon
